picketlink-webapps/as7/pdp/src/main/webapp/WEB-INF/wsdl/SOAPSAMLXACMLPDP.wsdl

<?xml version="1.0"?>
<wsdl:definitions name="SOAPSAMLXACMLPDP" targetNamespace="urn:picketlink:identity-federation:pdp"
	xmlns:tns="urn:picketlink:identity-federation:pdp" 
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
	xmlns:wsap10="http://www.w3.org/2006/05/addressing/wsdl"
	xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/">
  <wsdl:types>
    <xs:schema targetNamespace="urn:picketlink:identity-federation:pdp" 
      xmlns:tns="urn:picketlink:identity-federation:pdp" 
      xmlns:xs="http://www.w3.org/2001/XMLSchema"
      version="1.0" elementFormDefault="qualified">
      <xs:element name="MessageBody">
        <xs:complexType>
          <xs:sequence>
            <xs:any minOccurs="0" maxOccurs="unbounded" namespace="##any"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="Authorize">
    <wsdl:part name="authorizeMessage" element="tns:MessageBody"/>
  </wsdl:message>
  <wsdl:message name="AuthorizeResponse">
    <wsdl:part name="authorizerMessage" element="tns:MessageBody"/>
  </wsdl:message>
  <wsdl:portType name="SOAPSAMLXACMLPort">
    <wsdl:operation name="Authorize">
      <wsdl:input wsap10:Action="http://schemas.xmlsoap.org/ws/2005/02/trust/RST/Issue" message="tns:Authorize"/>
      <wsdl:output wsap10:Action="http://schemas.xmlsoap.org/ws/2005/02/trust/RSTR/Issue" message="tns:AuthorizeResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="PDPBinding" type="tns:SOAPSAMLXACMLPort">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="Authorize">
      <soap12:operation soapAction="http://schemas.xmlsoap.org/ws/2005/02/trust/RST/Issue" style="document"/>
      <wsdl:input>
        <soap12:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap12:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="SOAPSAMLXACMLPDP">
    <wsdl:port name="SOAPSAMLXACMLPort" binding="tns:PDPBinding">
      <soap12:address location="http://localhost:8080/SOAPSAMLXACMLPDP"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>